"use client";
import css from "./About.module.css";

const ShortAbout = () => {
  return (
    <div className={css.containerShortAbout}>
      <h3 className={css.titleShortAbout}>
        Вітаю! Коротко, що це за календар та для чого він. <br />
        <span className={css.spanTitleShortAbout}>
          {" "}
          Це місячний календар, що допомагає жити в ритмі, а не в хаосі.
        </span>
      </h3>

      <p className={css.textShortAbout}>
        Місяць рухається циклом, і разом із ним змінюються наші стани, рішення,
        енергія та внутрішня рівновага. Цей календар створений, щоб допомогти
        тобі відчувати ці зміни, розуміти їх і використовувати на свою користь.
      </p>

      <p className={css.textShortAbout}>
        Кожен день має свій характер — м’якість чи силу, ясність чи глибину, рух
        чи тишу. У календарі ці стани описані простою мовою і доповнені
        практичними ритуалами, рекомендаціями та поясненнями, чому саме сьогодні
        енергія працює так, а не інакше.
      </p>

      <p className={css.textShortAbout}>
        Це не астрологія і не містика. Це поєднання слов’янських символів,
        трипільських архетипів, тибетської енергетики та сучасної психології.
        Інструмент, який допомагає жити усвідомлено, приймати виважені рішення й
        підтримувати внутрішній баланс щодня.
      </p>

      <p className={css.textShortAbout}>
        Тут починається твій місячний цикл — шлях до ясності, стабільності та
        глибшого відчуття себе.
      </p>
      <p className={css.textShortAbout}>
        Для актуальності та зручності користування такі данні, як вік Місяця,
        молодик та повня базуються на асторнамічних розрахунках фізичного
        положення на небесній сфері. За цими ж критеріями здійснюються усі інші
        обчислення.
      </p>
      <p className={css.textShortAbout}>
        Ви також можете скористатися функцією пошуку оптимального дня для різних
        сфер(аспектів) життя із зазначенням конкретної дати. Окремо передбачено
        пошук за календарем: наприклад, ви можете дізнатися вік Місяця на певну
        дату або перевірити чи сприятливий цей день для стрижки.
      </p>
    </div>
  );
};

export default ShortAbout;
