"use client";

import { useOccultRitualToday } from "@/lib/hooks/useOccultRitualToday";

const OccultTodayClient = () => {
  const { data: today } = useOccultRitualToday();
  if (!today) return null;
  return (
    <div>
      <p>
        З давніх-давен наші предки знали, що Місяць має особливий сакральний
        статус, коли тонка завіса між світами дозволяє людині налаштувати власне
        життя в унісон із енергіями Всесвіту. Ця давня обрядова практика
        відкриває доступ до прихованих сил природи, допомагаючи перетворити своє
        потаємне бажання на реальну життєву силу.
      </p>
      <div>
        <h3>Енергія дня на: {today.energy_goal}</h3>
        <p>
          Це фокусування усього обряду допомагає налаштувати свідомість і
          виконати головне завдання цього дня, щоб осягнути те, що нам
          заповідали пращури.
        </p>
      </div>
      <div>
        <h3>Езотерична логіка</h3>
        <p>
          Вона пояснює приховані закони Всесвіту та сакральну мудрість предків,
          за якими народжується сила цього дня.{" "}
        </p>
        <p>{today.esoteric_logic}</p>
      </div>
      <div>
        <h3>Вплив на здоров’я</h3>
        <p>{today.health_effects}</p>
      </div>
      <div>
        <h3>Вплив на матеріальне благополуччя</h3>
        <p>{today.wealth_effects}</p>
      </div>
      <div>
        <h3>Запобіжні заходи</h3>
        <p>
          Вони окреслюють важливі правила безпеки, щоб зберегти ваші сили від
          прихованих енергетичних затисків. Зверніть увагу: {today.precautions}
        </p>
      </div>
      <div>
        <h3>Оптимальний час</h3>
        <p>
          Це той самий момент, коли знання предків, сили природи і Місяця
          найбільше допомагають вашим діям. Найкращий час для ритуалу —{" "}
        </p>
        <p>{today.optimal_time}</p>
      </div>
      <div>
        <h3>Матеріали</h3>
        <p>
          Це предмети, які допоможуть звернутися до стихійних сил, тому для
          проведення практики вам знадобляться:{" "}
        </p>
        <ul>
          {today.materials.map((m) => (
            <li key={m}>- {m}</li>
          ))}
        </ul>
      </div>
      <div>
        <p>
          Тепер, після розуміння того, як треба налаштувати свідомість,
          переходимо до чіткого покрокового опису самого обряду, де кожна дія
          пробуджує силу вашого слова і думки, відгукуючись у родовій пам`яті.
        </p>
        <h3>Кроки дій:</h3>
        <ol>
          {today.steps.map((s) => (
            <li key={s}>{s}</li>
          ))}
        </ol>
      </div>
    </div>
  );
};

export default OccultTodayClient;
